##  데이터프레임 행,열 삭제하기 (drop row, column)

In [3]:
import pandas as pd

In [25]:
friends = [{'age': 15, 'job': 'student'},
                    {'age': 25, 'job': 'developer'},
                    {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, 
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [26]:
print(id(df))
df

1495254247840

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [27]:
# 만약 john과 jenny의 이름을 삭제하고 싶다면?
print(id(df))
df.drop(['John','Jenny'])

1495254247840

      age      job
Nate   30  teacher

In [28]:
df = df.drop(['John','Jenny']) # 중괄호 사용해도 가능합니다.
print(id(df)) # drop하고 다시 보니 새로운 객체를 생성하여서 주소값이 변함.

1495254247792

In [29]:
df

      age      job
Nate   30  teacher

In [30]:
df = pd.DataFrame(friends, 
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [31]:
print(id(df))
df

1495254247408

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [32]:
# drop할때, inplace = True 값을 파라미터로 명시해주면 해당 dataframe에 변경된 값이 할당된다. inplace에 숫자 1넣으면 적용안됨.
print(id(df))
df.drop({'John','Nate'}, inplace = True) # 객체 생성을하지 않고 기존의 객체를 변경할수 있음?!
print(id(df))
df

1495254247408
1495254247408

       age        job
Jenny   25  developer

In [42]:
friends = [{'name' : 'John','age': 15, 'job': 'student'},
           {'name' : 'Ben','age': 25, 'job': 'developer'},
           {'name' : 'Jenny','age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, columns = ['name','age','job'])
df.index[[0,2]]
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [34]:
# name은 하나의 컬럼 정보로 되었다.(Series로 된거임. 다른 표현으로는 배열로 된거.)
# 여기서 John과 Jenny를 지우고 싶은 경우. 인덱스를 이용해서 삭제 할 수 있음. 
# index를 쓸때 중괄호를 두번 중첩해야 가능함. 
df.drop(df.index[[0,2]], inplace = True)
df

  name  age        job
1  Ben   25  developer

In [54]:
friends = [{'name' : 'John','age': 15, 'job': 'student'},
           {'name' : 'Ben','age': 25, 'job': 'developer'},
           {'name' : 'Jenny','age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, columns = ['name','age','job'])

df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [43]:
# age의 컬럼 값중 20살 이상의 값들만 조회하고 싶은 경우
df = df[df.age > 20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [44]:
df = pd.DataFrame(friends, columns = ['name','age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [50]:
# age라는 컬럼을 날리고 싶다면?!
# 여기서 axis는 y축을 의미하니깐! 컬럼값들 중에서를 의미함.
df = df.drop('age',axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [50]:
df = pd.DataFrame(friends, columns = ['name','age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [52]:
#inplace = True를 하면 마치 db의 commit과 같이 할당해버림. .
df.drop('age',axis=1, inplace = True)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher